005_bubble/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceGrabbed;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.06 -1 -0.0001) (0.0625 1 0.0001); // Edit box bounds as required
    }
    {
        name    faceGrabbed;
        type    faceSet;
        action  add;
        source  boxToFace;
        box     (0.1375 -1 -0.0001) (0.14 1 0.0001); // Edit box bounds as required
    }
);

// ************************************************************************* //
